Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: `TieredCompilation` can also be interesting for regular Lambda functions.
ja_jp: `TieredCompilation` は、通常のLambda関数でも興味深いことができます。

source: `TransactionalUniAsserter` Example
ja_jp: `TransactionalUniAsserter` 例

source: `TransformedAnnotationsBuildItem.getAnnotations()` will return a possibly transformed set of annotations.
ja_jp: `TransformedAnnotationsBuildItem.getAnnotations()` は、変換された可能性のあるアノテーションのセットを返します。

source: `TransformedAnnotationsBuildItem` Example
ja_jp: `TransformedAnnotationsBuildItem` の例

source: `USER_PROPERTY_NAME` and `PASSWORD_PROPERTY_NAME` are standard properties that should be recognized by any consuming extension that support username/password based authentication.
ja_jp: `USER_PROPERTY_NAME` と `PASSWORD_PROPERTY_NAME` は、ユーザー名/パスワードベースの認証をサポートするすべてのコンシューマーエクステンションで認識されるべき標準的なプロパティーです。

source: `Uni<Void>`: Denotes a non-blocking method where the completion of the returned `Uni` signifies the end of processing. No explicit response is sent back to the client.
ja_jp: `Uni<Void>`: 返された `Uni` の完了が処理の終了を意味するノンブロッキングメソッドを示します。明示的なレスポンスはクライアントに返されません。

source: `Uni<Void>`: Denotes a non-blocking method where the completion of the returned `Uni` signifies the end of processing. No message is sent back to the client.
ja_jp: `Uni<Void>`: 返された `Uni` の完了が処理の終了を意味するノンブロッキングメソッドを示します。クライアントにメッセージは返されません。

source: `Uni<Void>`: The method is considered non-blocking.
ja_jp: `Uni<Void>`: メソッドはノンブロッキングであるとみなされます。

source: `Uni<X>`: Specifies a non-blocking method where the item emitted by the non-null `Uni` is sent to the client as a response.
ja_jp: `Uni<X>`: null 以外の `Uni` によって発行された項目がレスポンスとしてクライアントに送信されるノンブロッキングメソッドを指定します。

source: `Uni<X>`: Specifies a non-blocking method where the item emitted by the non-null `Uni` is sent to the client.
ja_jp: `Uni<X>`: null 以外の `Uni` によって発行された項目がクライアントに送信されるノンブロッキングメソッドを指定します。

source: `Uni` and `Multi` are lazy types, which means that they do not start processing until they are subscribed to.
ja_jp: `Uni` と `Multi` は遅延タイプです。つまり、サブスクライブされるまで処理を開始しません。

source: `Uni` does not implement Reactive Streams `Publisher`. A `Uni` can only emit one event, so subscribing to the `Uni` is enough to express your intent to use the result and does not need the request protocol ceremony.
ja_jp: `Uni` は、Reactive Streams `Publisher` を実装していません。 `Uni` は1つのイベントしか発することができないので、 `Uni` をサブスクライブすることで、結果を使用する意思を表明することができ、リクエストプロトコルのセレモニーは必要ありません。

source: `Uni` is a type from the Mutiny library, which is the reactive programming library used by Quarkus. This will be explained in more detail in the "Reactive Programming" section below.
ja_jp: `Uni` は、Quarkusが使用しているリアクティブプログラミングライブラリであるMutinyライブラリの型です。これについては、後述の「リアクティブプログラミング」のセクションで詳しく説明します。

source: `UnremovableBeanBuildItem` Example
ja_jp: `UnremovableBeanBuildItem` の例

source: `VERBATIM` - The method name is used as is to map the configuration property, i.e. `theHost` maps to `theHost`.
ja_jp: `VERBATIM` - メソッド名はそのままコンフィギュレーション・プロパティにマッピングするために使われます。つまり、 `theHost` は `theHost` にマッピングされます。

source: `VERBATIM` - The method name is used as is to map the configuration property.
ja_jp: `VERBATIM` - メソッド名は、設定プロパティをマッピングするためにそのまま使用されます。

source: `ValueResolver` Builder Example
ja_jp: `ValueResolver` ビルダー例

source: `VertxContextSupport#subscribeAndAwait()` must not be called on an event loop!
ja_jp: `VertxContextSupport#subscribeAndAwait()` をイベントループで呼んではいけません！

source: `WORKDIR` for the image used for compression
ja_jp: 圧縮に使用されるイメージの `WORKDIR`

source: `WasmQuarkusContext` instances are injected as `@ApplicationScoped` beans. This means that a unique application instance can be used by several clients (or user requests) and threads. That being said, the API implementation is _stateless_, i.e. `getMachineFactory()` and `getWasmModule()` always return new instances.
ja_jp: `WasmQuarkusContext` インスタンスは `@ApplicationScoped` Bean としてインジェクトされます。これは、単一のアプリケーションインスタンスが複数のクライアント (またはユーザーリクエスト) やスレッドによって使用される可能性があることを意味します。とはいえ、API の実装は _ステートレス_ であり、 `getMachineFactory()` と `getWasmModule()` は常に新しいインスタンスを返します。

source: `WebSocketConnection#pathParam(String)` example
ja_jp: `WebSocketConnection#pathParam(String)` の例

source: `WriteStreams<T>` => can be consumed as Reactive Streams `Subscriber<T>`
ja_jp: `WriteStreams<T>` ⇒ リアクティブストリームとして消費することができます。 `Subscriber<T>`

source: `XML` format can be requested by setting `format` goal parameter (or `quarkus.dependency.sbom.format` property) to `xml`.
ja_jp: `XML` 形式は、 `format` ゴールパラメーター (または `quarkus.dependency.sbom.format` プロパティー) を `xml` に設定することでリクエストできます。

source: `X` is a new name for `Twitter`. You can currently use either `quarkus.oidc.provider=x` or `quarkus.oidc.provider=twitter` but only `quarkus.oidc.provider=x` may end up supported in the future.
ja_jp: `X` は `Twitter` の新しい名前です。現在、 `quarkus.oidc.provider=x` または `quarkus.oidc.provider=twitter` のどちらかを使用することができますが、将来的には `quarkus.oidc.provider=x` のみがサポートされるようになるかもしれません。

source: `YOUR-RESERVED-DOMAIN-ID` is your reserved domain's ID, which starts from `rd_`; you can find it in the link:https://dashboard.ngrok.com/cloud-edge/domains[ngrok dashboard domains section].
ja_jp: `YOUR-RESERVED-DOMAIN-ID` は、 `rd_` で始まる予約済みドメインの ID です。これは link:https://dashboard.ngrok.com/cloud-edge/domains[ngrok ダッシュボードのドメインセクション] で確認できます。

source: `YOUR-RESERVED-DOMAIN-ID` is your reserved domain's id which starts from `rd_`, you can find it in the link:https://dashboard.ngrok.com/cloud-edge/domains[ngrok dashboard domains section].
ja_jp: `YOUR-RESERVED-DOMAIN-ID` は、 `rd_` で始まる予約済みドメインの ID です。この ID は、 link:https://dashboard.ngrok.com/cloud-edge/domains[ngrok ダッシュボードドメインセクション] で確認できます。

source: `[Client|Producer|Consuemr]ConfigurationData` object produced with identifier in the channel configuration or the channel name
ja_jp: チャネル設定内またはチャネル名内の識別子を使用して生成された `[Client|Producer|Consuemr]ConfigurationData` オブジェクト

source: `\*.pkg.Test*`: all classes in package `pkg` (regardless of the parent packages) starting with `Test`
ja_jp: `\*.pkg.Test*`: パッケージ `pkg` 内のすべてのクラス (親パッケージに関係なく) で、`Test` で始まります。

source: `\*/*` which is a wildcard for any media type
ja_jp: 任意のメディアタイプのワイルドカードである `\*/*`

source: `\\.` matches any single character as a regular expression metadata character.
ja_jp: `\\.` は、正規表現メタデータ文字として任意の 1 文字として解釈されます。

source: `\\\\.` matches a literal `.` character.
ja_jp: `\\\\.` はリテラルの `.` 文字として解釈されます。

source: `_args.asHtmlAttributes` - renders the arguments as HTML attributes; e.g. `foo="true" readonly="readonly"`; the arguments are sorted by name in alphabetical order and the `'`, `"`, `<`, `>`, `&` characters are escaped
ja_jp: `_args.asHtmlAttributes` - 引数を HTML 属性としてレンダリングします (例: `foo="true" readonly="readonly"`)。引数は名前のアルファベット順にソートされ、`'`、`"`、`<`, `>`、`&` の文字はエスケープされます。

source: `_args.empty`/`_args.isEmpty` - returns `true` if no arguments are passed
ja_jp: `_args.empty`/`_args.isEmpty` - 引数が渡されない場合は `true` を返します。

source: `_args.filter(String...)` - returns the arguments matching the given names
ja_jp: `_args.filter(String...)` - 指定された名前に一致する引数を返します。

source: `_args.filterIdenticalKeyValue` - returns the arguments with the name equal to the value; typically `foo` from `{#test foo="foo" bar=true}` or `{#test "foo" bar=true /}`
ja_jp: `_args.filterIdenticalKeyValue` - 値と等しい名前を持つ引数を返します。通常は `{#test foo="foo" bar=true}` または `{#test "foo" bar=true /}` から`foo` が返されます。

source: `_args.get(String name)` - returns the argument value of the given name or `null`
ja_jp: `_args.get(String name)` - 指定された名前の引数値または `null` を返します。

source: `_args.size` - returns the actual number of arguments passed to a tag
ja_jp: `_args.size` - タグに渡された引数の実際の数を返します。

source: `_args.skip(String...)` - returns only the arguments that do not match the given names
ja_jp: `_args.skip(String...)` - 指定された名前と一致しない引数のみを返します。

source: `_args.skipIdenticalKeyValue` - returns only the arguments with the name not equal to the value; typically `bar` from `{#test foo="foo" bar=true /}`
ja_jp: `_args.skipIdenticalKeyValue` - 値と等しくない名前を持つ引数のみを返します。通常は `{#test foo="foo" bar=true /}` から `bar` が返されます。

source: `_args.skipIt` - returns all arguments except for the first unnamed argument; typically `bar` from `{#test foo bar=true /}`
ja_jp: `_args.skipIt` - 最初の名前なし引数を除くすべての引数を返します。通常は `{#test foo bar=true /}` から `bar` が返されます。

source: `_args` is also iterable of `java.util.Map.Entry`: `{#each _args}{it.key}={it.value}{/each}`.
ja_jp: `_args` は 反復可能な `java.util.Map.Entry` でもあります (`{#each _args}{it.key}={it.value}{/each}`)。

source: `_args` represents arguments metadata.
ja_jp: `_args` は引数のメタデータを表します。

source: ``CredentialsProvider``s are now supported for MongoDB connections.
ja_jp: `CredentialsProvider` がMongoDB接続でサポートされるようになりました。

source: `a2a-java-extras-bom`: Optional extensions (JpaDatabaseTaskStore and -PushNotificationStore, replicated QueueManager, Vert.X HTTP client)
ja_jp: `a2a-java-extras-bom`: オプションの拡張機能 (JpaDatabaseTaskStore および -PushNotificationStore、レプリケートされたQueueManager、Vert.X HTTPクライアント)

source: `a2a-java-reference-bom`: Quarkus reference implementations
ja_jp: `a2a-java-reference-bom`: Quarkusリファレンス実装

source: `a2a-java-sdk-bom`: Core SDK and client libraries
ja_jp: `a2a-java-sdk-bom`: コアSDKおよびクライアントライブラリ

source: `accept` - this strategy marks the AMQP message as _accepted_. The processing continues ignoring the failure. Refer to the http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[accepted delivery state documentation].
ja_jp: `accept` - この戦略は、AMQP メッセージを _accepted_ としてマークします。処理は失敗を無視して続行します。 http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[accepted delivery state documentation] を参照してください。

source: `accept` - this strategy marks the AMQP message as _accepted_. The processing continues ignoring the failure. Refer to the https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[accepted delivery state documentation].
ja_jp: `accept` - この戦略は、AMQP メッセージを _accepted_ としてマークします。処理は失敗を無視して続行します。 https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[accepted delivery state documentation] を参照してください。

source: `accept` - this strategy marks the AMQP message as _accepted_. The processing continues, ignoring the failure. Refer to the https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[accepted delivery state documentation].
ja_jp: `accept` - この戦略は AMQP メッセージを _受理 (accepted)_ としてマークします。失敗を無視して処理を続行します。 https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[accepted 配信状態のドキュメント] を参照してください。

source: `accept` - this strategy marks the RabbitMQ message as _accepted_. The processing continues ignoring the failure.
ja_jp: `accept` - この戦略は、RabbitMQ メッセージを _承認済み_ としてマークします。処理は失敗を無視して続行します。

source: `accept` - this strategy marks the RabbitMQ message as _accepted_. The processing continues, ignoring the failure.
ja_jp: `accept` - この戦略は、RabbitMQ メッセージを _承認済み_ としてマークします。処理は失敗を無視して続行します。

source: `acme-` will group this guide with other resources related to the acme extension
ja_jp: `acme-` は、このガイドを acme エクステンションに関連する他のリソースとグループ化します

source: `age` resolves to `Globals#age`.
ja_jp: `age` は `Globals#age` に解決されます。

source: `alert` method blocks the virtual thread until the REST call returns.
ja_jp: `alert` メソッドは、REST 呼び出しが返されるまで仮想スレッドをブロックします。

source: `all` - scan all dependencies
ja_jp: `all` - すべての依存関係をスキャンします。

source: `all` - scan all the dependencies
ja_jp: `all` - すべての依存関係をスキャンする

source: `all` to also enable low level logging of the underlying libraries.
ja_jp: `all` は、基礎となるライブラリーの低レベルのロギングも有効にします。

source: `always`: always use replica nodes (if there's more than one replica in the shard, it is selected randomly), never send queries to master nodes
ja_jp: `always`: 常にレプリカノードを使用します (シャード内にレプリカが複数ある場合は無作為に選択されます)。マスターノードにクエリーを送信しません。

source: `always`: always use replica nodes (if there's more than one replica, it is selected randomly), never send queries to the master node
ja_jp: `always`: 常にレプリカノードを使用します (レプリカが複数ある場合はランダムに選択されます)。マスターノードにクエリーを送信しません。

source: `amount > ?1 and firstname != ?2` will be mapped to `{'amount': {'$gt': ?1}, 'firstname': {'$ne': ?2}}`
ja_jp: `amount > ?1 and firstname != ?2` は `{'amount': {'$gt': ?1}, 'firstname': {'$ne': ?2}}` にマッピングされます。

source: `anonymousId` is the locally generated anonymous user id.
ja_jp: `anonymousId` はローカルで生成された匿名ユーザーIDです。

source: `another.prop` value is 1234.
ja_jp: `another.prop` の値は1234です。

source: `api-only` only starts a Kubernetes API Server (plus the required etcd). If you need a fully-featured Kubernetes cluster that can spin up Pods, you can use `k3s` or `kind`. `k3s` requires to start the container with `privileged mode`. The `kind` test container now also supports using podman's rootless mode.
ja_jp: `api-only` は Kubernetes API サーバー（と必要な etcd）のみを起動します。Pod を起動できるフル機能の Kubernetes クラスターが必要な場合は、`k3s` または `kind` を使用できます。`k3s` は、コンテナーを `privileged mode` で起動する必要があります。`kind` テストコンテナーは、Podman のルートレスモードの使用もサポートするようになりました。

source: `api-only` only starts a Kubernetes API Server (plus the required etcd). If you need a fully-featured Kubernetes cluster that can spin up Pods, you can use `k3s` or `kind`. `k3s` requires to start the container with `privileged mode`. The `kind` test container supports now to use podman rootless or rootfull.
ja_jp: `api-only` は Kubernetes API サーバー (および必要な etcd) のみを起動します。Pod を起動できるフル機能の Kubernetes クラスターが必要な場合は、 `k3s` または `kind` を使用できます。 `k3s` では、コンテナを `privileged mode` で起動する必要があります。 `kind` テスト コンテナは、podman rootless または rootfull の使用をサポートするようになりました。

source: `api-only` only starts a Kubernetes API Server. If you need a fully-featured Kubernetes cluster that can spin up Pods, you can use `k3s` or `kind`. Note that they both requires to run in Docker privileged mode.
ja_jp: `api-only` は、Kubernetes API Serverを起動するだけです。Podをスピンアップすることができる、完全な機能を持ったKubernetesクラスタが必要な場合は、 `k3s` または `kind` を使用できます。 どちらも特権モードのDockerで実行する必要があることに注意してください。

source: `apicurio-registry-client` 2.1.5.Final with `apicurio-common-rest-client-vertx` 0.1.5.Final
ja_jp: `apicurio-registry-client` 2.1.5.Final と 0.1.5.Final `apicurio-common-rest-client-vertx`

source: `apicurio-registry-client` 2.3.1.Final with `apicurio-common-rest-client-vertx` 0.1.13.Final
ja_jp: `apicurio-registry-client` 2.3.1.Final と 0.1.13.Final `apicurio-common-rest-client-vertx`

source: `appName` - Use the default value. This is the application name in Azure. It must be a unique subdomain name under `*.azurewebsites.net`. Otherwise deploying to Azure will fail.
ja_jp: `appName` - 既定値を使用します。これは、Azure でのアプリケーション名です。 `*.azurewebsites.net` 以下の一意のサブドメイン名である必要があります。そうしないと、Azure へのデプロイに失敗します。

source: `appName` - Use the default value. This is the application name in Azure. It must be a unique subdomain name under `*.azurewebsites.net`. Otherwise, deploying to Azure will fail.
ja_jp: `appName` - 既定値を使用します。これは、Azure でのアプリケーション名です。 `*.azurewebsites.net` 以下の一意のサブドメイン名である必要があります。そうしないと、Azure へのデプロイに失敗します。

source: `appRegion` - Defaults to `westus`. Dependent on your azure region.
ja_jp: `appRegion` - デフォルトは `westus` です。お使いの azure リージョンに依存します。

source: `appendOutput` - the default value is `false`, indicates whether the output to the command should be appended to the file specified with the `outputFile` parameter or it should be overridden.
ja_jp: `appendOutput` - デフォルト値は `false` で、コマンドへの出力を `outputFile` パラメーターで指定されたファイルに追加するか、上書きするかを示します。

source: `appendOutput` - the default value is `false`, indicates whether the output to the command should be appended to the file specified with the `outputFile` parameter or it should be overriden.
ja_jp: `appendOutput` - デフォルト値は `false` で、コマンドへの出力を `outputFile` パラメーターで指定されたファイルに追加するか、オーバーライドするかを示します。

source: `application.properties` Example
ja_jp: `application.properties` の例

source: `application.properties` from `/config`
ja_jp: `/config` からの `application.properties`

source: `application.properties` from application
ja_jp: アプリケーションからの `application.properties`

source: `application/json` for a <<json,JSON REST endpoint>>
ja_jp: <<json,JSON REST endpoint>> の `application/json`

source: `application/json` for a xref:json[JSON REST endpoint]
ja_jp: xref:json[JSON REST endpoint] の場合 `application/json`

source: `artifactId` - The maven artifactId of this generated project. Type in `quarkus-demo`
ja_jp: `artifactId` - この生成されたプロジェクトの maven artifactId。を入力します。 `quarkus-demo` と入力します。

source: `assertThatGeneratedFileMatchSnapshot()` check a project file against the snapshot.
ja_jp: `assertThatGeneratedFileMatchSnapshot()` は、プロジェクトファイルをスナップショットと照合します。

source: `assertThatGeneratedTreeMatchSnapshots()` lets you compare the project file structure (tree) for a specific language against its snapshot.
ja_jp: `assertThatGeneratedTreeMatchSnapshots()` では、特定の言語のプロジェクトのファイル構造（ツリー）を、そのスナップショットと比較することができます。

source: `authScheme` is `null`.
ja_jp: `authScheme` はnullです

source: `authScheme` is null
ja_jp: `authScheme` はnullです

source: `auto` (default): Uses `integration-tests` for Leyden AOT
ja_jp: `auto` (デフォルト): Leyden AOT のために `integration-tests` を使用します

source: `auto` -- the default option; works the same as `callback` and `ddl` enabled simultaneously when the application uses `quarkus-hibernate-validator`, and as `none` otherwise.
ja_jp: `auto` -- デフォルトのオプション。アプリケーションが `quarkus-hibernate-validator` を使用している場合は `callback` と `ddl` が同時に有効である場合と同様に動作し、そうでない場合は `none` として動作します。

source: `avro.codegen.[avsc|avdl|avpr].imports` - a list of files or directories that should be compiled first thus making them importable by subsequently compiled schemas. Note that imported files should not reference each other. All paths should be relative to the `src/[main|test]/avro` directory, or `avro` sub-directory in any source directory configured by the build system. Passed as a comma-separated list.
ja_jp: `avro.codegen.[avsc|avdl|avpr].imports` - 最初にコンパイルされるべきファイルやディレクトリのリストで、後にコンパイルされるスキーマからインポートできるようにします。インポートされたファイルは互いに参照しあってはならないことに注意してください。すべてのパスは `src/[main|test]/avro` ディレクトリ、またはビルドシステムによって設定された任意のソースディレクトリの `avro` サブディレクトリからの相対パスでなければなりません。カンマで区切られたリストとして渡されます。

source: `avro.codegen.[avsc|avdl|avpr].imports` - a list of files or directories that should be compiled first thus making them importable by subsequently compiled schemas. Note that imported files should not reference each other. All paths should be relative to the `src/[main|test]/avro` directory. Passed as a comma-separated list.
ja_jp: `avro.codegen.[avsc|avdl|avpr].imports` - 最初にコンパイルする必要があるファイルまたはディレクトリーのリスト。これにより、後でコンパイルされるスキーマでインポートが可能になります。インポートされたファイルは相互に参照してはならないことに注意してください。すべてのパスは、 `src/[main|test]/avro` ディレクトリーに対する相対パスでなければなりません。コンマ区切りのリストとして渡されます。

source: `avro.codegen.createOptionalGetters` - enables generating the `getOptional...` methods that return an Optional of the requested type. Defaults to `false`
ja_jp: `avro.codegen.createOptionalGetters` - 要求されたタイプの Optional を返す`getOptional...` メソッドを生成できるようにします。デフォルトは `false` です。

source: `avro.codegen.createSetters` - determines whether to create setters for the fields of the record. Defaults to `false`
ja_jp: `avro.codegen.createSetters` - レコードのフィールドにセッターを作成するかどうかを決定します。デフォルトは `false` です。

source: `avro.codegen.enableDecimalLogicalType` - determines whether to use Java classes for decimal types, defaults to `false`
ja_jp: `avro.codegen.enableDecimalLogicalType` - 10 進型に Java クラスを使用するかどうかを決定します。デフォルトは `false` です。

source: `avro.codegen.gettersReturnOptional` - enables generating `get...` methods that return an Optional of the requested type. Defaults to `false`
ja_jp: `avro.codegen.gettersReturnOptional` - 要求されたタイプの Optional を返す `get...` メソッドを生成できるようにします。デフォルトは `false` です。

source: `avro.codegen.optionalGettersForNullableFieldsOnly`, works in conjunction with `gettersReturnOptional` option. If it is set, `Optional` getters will be generated only for fields that are nullable. If the field is mandatory, regular getter will be generated. Defaults to `false`
ja_jp: `avro.codegen.optionalGettersForNullableFieldsOnly` は、 `gettersReturnOptional` オプションと連携して機能します。設定されている場合、 `Optional` ゲッターは null 許容フィールドに対してのみ生成されます。フィールドが必須の場合、通常のゲッターが生成されます。デフォルトは `false` です。

source: `avro.codegen.stringType` - the Java type to use for Avro strings. May be one of `CharSequence`, `String` or `Utf8`. Defaults to `String`
ja_jp: `avro.codegen.stringType` - Avro 文字列に使用する Java タイプ。 `CharSequence`、 `String`、 `Utf8` のいずれかである可能性があります。デフォルトは `String` です。

source: `banana/a-proto.proto` file.
ja_jp: `banana/a-proto.proto` ファイル

source: `bean:` followed by the name of a `@Named` CDI bean. For example `bean:myBean`.
ja_jp: `bean:` の後に `@Named` CDI Beanの名前が続きます。例えば `bean:myBean` .

source: `beanClass` - include beans with bean class that starts with the given value, i.e. `http://localhost:8080/q/arc/beans?beanClass=org.acme.Foo`
ja_jp: `beanClass` - 与えられた値で始まる Bean クラスを持つ Bean を含みます (つまり `http://localhost:8080/q/arc/beans?beanClass=org.acme.Foo`)。

source: `beans.xml` descriptor content is ignored
ja_jp: `beans.xml` 記述子の内容は無視されます。

source: `bindAddress` becomes `bind-address`
ja_jp: `bindAddress` は `bind-address` になります

source: `blaze-persistence-integration-jackson` for link:https://persistence.blazebit.com/documentation/entity-view/manual/en_US/index.html#Jackson%20integration[Jackson]
ja_jp: link:https://persistence.blazebit.com/documentation/entity-view/manual/en_US/index.html#Jackson%20integration[Jackson] の為に `blaze-persistence-integration-jackson`

source: `blaze-persistence-integration-jaxrs` for link:https://persistence.blazebit.com/documentation/entity-view/manual/en_US/index.html#jaxrs-integration[JAX-RS]
ja_jp: link:https://persistence.blazebit.com/documentation/entity-view/manual/en_US/index.html#jaxrs-integration[JAX-RS]の為に `blaze-persistence-integration-jaxrs`

source: `bootstrap-example.sh` - example bootstrap script for native deployments
ja_jp: `bootstrap-example.sh` - ネイティブデプロイメント用のブートストラップスクリプトの例

source: `buildName(item.name,5)` represents a virtual method with name `buildName` and two parameters: `item.name` and `5` . The virtual method could be evaluated by a value resolver generated for the following Java class:
ja_jp: `buildName(item.name,5)` は、名前 `buildName` と 2 つのパラメーター `item.name` と `5` を持つ仮想メソッドを表します。この仮想メソッドは、以下の Java クラスに対して生成された値リゾルバによって評価されます。

source: `build`: Generates the cache during build (very limited training, faster builds)
ja_jp: `build`: ビルド中にキャッシュを生成します (トレーニングは非常に限定的ですが、ビルドは速くなります)

source: `bytes.written` is the summary name
ja_jp: `bytes.written` はサマリー名です

source: `ca.crt` for the CA certificate (if needed)
ja_jp: CA 証明書用の `ca.crt` (必要な場合)

source: `cacerts` must be added to `function.zip`
ja_jp: `function.zip` に `cacerts` を追加する必要があります。

source: `call_tree` csv file reports are some of the default reports generated when the `-Dquarkus.native.enable-reports` option is passed in. These csv files can be imported into a graph database, such as Neo4j, to inspect them more easily and run queries against the call tree. This is useful for getting an approximation on why a method/class is included in the binary.
ja_jp: `call_tree` csv ファイルレポートは、 `-Dquarkus.native.enable-reports` オプションが渡されたときに生成されるデフォルトレポートの一部です。これらの csv ファイルは、Neo4j などのグラフデータベースにインポートして、より簡単に検査できます。呼び出しツリーに対してクエリーを実行します。これは、メソッド/クラスがバイナリーに含まれている理由の概算を取得するのに役立ちます。

source: `call_tree` text file report is one of the default reports generated when the `-Dquarkus.native.enable-reports` option is passed in. This is useful for getting an approximation on why a method/class is included in the binary. However, the text format makes it very difficult to read and can take up a lot of space.
ja_jp: `call_tree` テキストファイルレポートは、 `-Dquarkus.native.enable-reports` オプションが渡されたときに生成されるデフォルトのレポートの1つです。これは、あるメソッド/クラスがなぜバイナリに含まれているのかについて、おおよその見当をつけるのに便利です。しかし、テキスト形式のため非常に読みづらく、多くのスペースを必要とします。
